# 3.Let's answer the following questions

In [1]:
import pandas as pd
import numpy as np
import os

#### Read in the data.

In [3]:
# Go to the directory where the data file is located. 
# os.chdir(r'~~')  
# Please, replace the path with your own.

In [4]:
df = pd.read_csv('./data/data_sales.csv', header='infer')

In [5]:
df.shape

(43, 5)

In [6]:
df.head(5)

        Date   Region     Item  Unit Price  Units
0  04-Jul-14     East  Pen Set        4.99     62
1  12-Jul-14     East   Binder        1.99     29
2  21-Jul-14  Central  Pen Set       12.49     55
3  29-Jul-14     East   Binder       19.99     81
4  07-Aug-14  Central  Pen Set       23.95     42

#### Answer the following questions.

1). Append a new variable $Amount = UnitPric \times Units$.

In [8]:
Amount = df['Unit Price']*df['Units']
df['Amount']= Amount
df.head()

        Date   Region     Item  Unit Price  Units   Amount
0  04-Jul-14     East  Pen Set        4.99     62   309.38
1  12-Jul-14     East   Binder        1.99     29    57.71
2  21-Jul-14  Central  Pen Set       12.49     55   686.95
3  29-Jul-14     East   Binder       19.99     81  1619.19
4  07-Aug-14  Central  Pen Set       23.95     42  1005.90

2). Average unit price for each region. Use the groupby() method.

In [18]:
df.groupby(by='Region', as_index=False)['Unit Price'].mean()

    Region  Unit Price
0  Central   18.018750
1     East    9.143846
2     West   53.658333

3). Average unit price for each region. Use the pivot_table() method.

In [33]:
pd.pivot_table(df,index=["Region"],values=["Unit Price"], aggfunc=np.mean)

         Unit Price
Region
Central   18.018750
East       9.143846
West      53.658333

4). Average unit price and units for each region in one code sentence. Use the groupby() method.

In [20]:
df.groupby(by='Region')[["Unit Price", "Units"]].mean()

         Unit Price      Units
Region
Central   18.018750  49.958333
East       9.143846  53.153846
West      53.658333  38.500000

5). Average unit price and units for each region in one code sentence. Use the pivot_table() method.

In [35]:
pd.pivot_table(df,index=["Region"] ,values=(["Unit Price" , "Units"]))

         Unit Price      Units
Region
Central   18.018750  49.958333
East       9.143846  53.153846
West      53.658333  38.500000

6). Total units for each region and item type in one code sentence. Use the pivot_table() method. Fill the missing values with 0.

In [29]:
df.isna().sum()

Date          0
Region        0
Item          0
Unit Price    0
Units         0
Amount        0
dtype: int64

We don't have missing values in our dataframe

In [30]:
pd.pivot_table(df,index=["Region" , "Item"],values=["Units"], aggfunc=np.sum)

                 Units
Region  Item
Central Binder     424
        Desk         7
        Pen         27
        Pen Set    243
        Pencil     498
East    Binder     234
        Pen        175
        Pen Set    152
        Pencil     130
West    Binder      64
        Desk         3
        Pen         76
        Pencil      88

7). Total sales amount for each region and item type in one code sentence. Use the pivot_table() method. Fill the missing values with 0.

In [31]:
pd.pivot_table(df,index=["Region" , "Item"],values=["Amount"],aggfunc=np.sum)

                  Amount
Region  Item
Central Binder   5762.63
        Desk      875.00
        Pen       539.73
        Pen Set  2421.39
        Pencil   1540.32
East    Binder   2535.66
        Pen      1354.25
        Pen Set  1748.48
        Pencil    363.70
West    Binder   1279.36
        Desk      825.00
        Pen       151.24
        Pencil    231.12